# InsertJoinedWall Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..InfillFailures..::..InsertJoinedWall Property
BuiltInFailures..::..InfillFailures Class See Also
---
Insert conflicts with joined Wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InsertJoinedWall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InsertJoinedWall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InsertJoinedWall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..InfillFailures Class
Autodesk.Revit.DB Namespace